#+startup: latexpreview
* Virtual environment for Python
  #+begin_src bash :dir ./ :results drawer :exports none
    pwd
    virtualenv py3_venv
  #+end_src

  #+RESULTS:
  :results:
  /home/lsg/dev/Python/PBM
  Using base prefix '/usr'
  New python executable in /home/lsg/dev/Python/PBM/py3_venv/bin/python3
  Also creating executable in /home/lsg/dev/Python/PBM/py3_venv/bin/python
  Installing setuptools, pip, wheel...
  done.
  :end:
  #+begin_src elisp :results drawer :exports none
    (pyvenv-activate "home/lsg/dev/Python/PBM/py3_venv")
  #+end_src

  #+RESULTS:
  :results:
  nil
  :end:
  #+begin_src bash :results drawer :exports none
    pip install numpy matplotlib
  #+end_src

  #+RESULTS:
  :results:
  Collecting numpy
    Using cached https://files.pythonhosted.org/packages/1f/c7/198496417c9c2f6226616cff7dedf2115a4f4d0276613bab842ec8ac1e23/numpy-1.16.4-cp27-cp27mu-manylinux1_x86_64.whl
  Collecting matplotlib
    Using cached https://files.pythonhosted.org/packages/32/6b/0368cfa5e1d1ae169ab7dc78addda3fd5e6262e48d7373a9114bac7caff7/matplotlib-2.2.4-cp27-cp27mu-manylinux1_x86_64.whl
  Collecting cycler>=0.10 (from matplotlib)
    Using cached https://files.pythonhosted.org/packages/f7/d2/e07d3ebb2bd7af696440ce7e754c59dd546ffe1bbe732c8ab68b9c834e61/cycler-0.10.0-py2.py3-none-any.whl
  Collecting backports.functools-lru-cache (from matplotlib)
    Using cached https://files.pythonhosted.org/packages/03/8e/2424c0e65c4a066e28f539364deee49b6451f8fcd4f718fefa50cc3dcf48/backports.functools_lru_cache-1.5-py2.py3-none-any.whl
  Collecting subprocess32 (from matplotlib)
  Collecting kiwisolver>=1.0.1 (from matplotlib)
    Using cached https://files.pythonhosted.org/packages/3d/78/cb9248b2289ec31e301137cedbe4ca503a74ca87f88cdbfd2f8be52323bf/kiwisolver-1.1.0-cp27-cp27mu-manylinux1_x86_64.whl
  Collecting pytz (from matplotlib)
    Using cached https://files.pythonhosted.org/packages/3d/73/fe30c2daaaa0713420d0382b16fbb761409f532c56bdcc514bf7b6262bb6/pytz-2019.1-py2.py3-none-any.whl
  Collecting six>=1.10 (from matplotlib)
    Using cached https://files.pythonhosted.org/packages/73/fb/00a976f728d0d1fecfe898238ce23f502a721c0ac0ecfedb80e0d88c64e9/six-1.12.0-py2.py3-none-any.whl
  Collecting python-dateutil>=2.1 (from matplotlib)
    Using cached https://files.pythonhosted.org/packages/41/17/c62faccbfbd163c7f57f3844689e3a78bae1f403648a6afb1d0866d87fbb/python_dateutil-2.8.0-py2.py3-none-any.whl
  Collecting pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.1 (from matplotlib)
    Using cached https://files.pythonhosted.org/packages/dd/d9/3ec19e966301a6e25769976999bd7bbe552016f0d32b577dc9d63d2e0c49/pyparsing-2.4.0-py2.py3-none-any.whl
  Collecting setuptools (from kiwisolver>=1.0.1->matplotlib)
    Using cached https://files.pythonhosted.org/packages/ec/51/f45cea425fd5cb0b0380f5b0f048ebc1da5b417e48d304838c02d6288a1e/setuptools-41.0.1-py2.py3-none-any.whl
  Installing collected packages: numpy, six, cycler, backports.functools-lru-cache, subprocess32, setuptools, kiwisolver, pytz, python-dateutil, pyparsing, matplotlib
  Successfully installed backports.functools-lru-cache-1.5 cycler-0.10.0 kiwisolver-1.1.0 matplotlib-2.2.4 numpy-1.16.4 pyparsing-2.4.0 python-dateutil-2.8.0 pytz-2019.1 setuptools-41.0.1 six-1.12.0 subprocess32-3.5.4
  :end:
* Gauss-Newton algorithm for ODE models
  #+begin_src python :session gnode :results drawer
    import numpy as np
    import matplotlib.pyplot as plt
  #+end_src

  #+RESULTS:
  :results:
  :end:

For the intial value problem
\begin{equation*}
\frac{d\mathbf{y}(t)}{dt}=\mathbf{f}(
\mathbf{y}(t),\mathbf{k});~~\mathbf{y}(t_0)=\mathbf{y}_0
\end{equation*}
the objective function with the weighting matrix $\mathbf{Q}_i$ is
\begin{equation*}
S(\mathbf{k})=\sum_{i=1}^N[\hat{\mathbf{y}}_i-\mathbf{y}(t_i,\mathbf{k})]^\top\mathbf{Q}_i[\hat{\mathbf{y}}_i-\mathbf{y}(t_i,\mathbf{k})]
\end{equation*}
*** GN
$y=k_1+\frac{x_1}{k_2x_2+k_3x_3}$, $J_{11}=\frac{\partial y_1}{\partial k_1}=1$, $J_{12}=\frac{\partial y_1}{\partial k_2}=-\frac{x_1x_2}{(k_2x_2+k_3x_3)^2}$, $J_{13}=\frac{\partial y_1}{\partial k_3}=-\frac{x_1x_3}{(\k_2x_2+k_3x_3)^2}$.
with data
#+begin_src python :session gnode :results output :exports none
  yhat = np.zeros((1,15))
  yhat[0,:] = np.array([0.14,0.18,0.22,0.25,0.29,0.32,0.35,0.39,0.37,0.58,0.73,0.96,1.34,2.10,4.39])
  x1 = np.array([1,2,3,4,5,6,7,8,9,10,11,12,13,14,15])
  x2 = np.array([15,14,13,12,11,10,9,8,7,6,5,4,3,2,1])
  x3 = np.array([1,2,3,4,5,6,7,8,7,6,5,4,3,2,1])

  def f(x,k):
      y = np.zeros((1,15))
      y[0,:] = k[0]+x[0]/(k[1]*x[1]+k[2]*x[2])
      return y

  def jac(x,k):
      n = 1
      N = np.size(x,1)
      p = np.size(k)
      j = np.zeros((n,p,N))
      j[0,0,:] = 1
      j[0,1,:] = -x[0]*x[1]/np.power(k[1]*x[1]+k[2]*x[2],2)
      j[0,2,:] = -x[0]*x[2]/np.power(k[1]*x[1]+k[2]*x[2],2)
      return j 

  k = np.array([1,1,1])
  x = (x1,x2,x3)
  J = jac(x,k)
  Q = np.eye(1)

  y = f(x,k)

  k_new = bisect(J,x,yhat,f,Q,k)
#+end_src

#+RESULTS:
: [-0.91735248  0.18349326  0.66614514]
